#+TITLE: gyokaikyo プロジェクトノート
#+PROPERTY: header-args :exports code :results scalar :session *R:tidyNAS*
#+STARTUP: contents

* 目次                                                                :TOC_3:
- [[#これは何か][これは何か？]]
- [[#レガシーファイル構成を整理する][レガシーファイル構成を整理する]]
  - [[#カタクチyyxlsx][★カタクチYY.xlsx]]
    - [[#ファイルがやっていること][ファイルがやっていること]]
    - [[#問題点][問題点]]
    - [[#解決策][解決策]]
  - [[#各県いわし][各県いわし]]
- [[#ディレクトリの構成][ディレクトリの構成]]
- [[#パッケージの機能][パッケージの機能]]
  - [[#データ目録の生成][データ目録の生成]]
  - [[#データの統合][データの統合]]
  - [[#グラフ描画][グラフ描画]]
  - [[#予報文案テンプレートの生成][予報文案テンプレートの生成]]
- [[#デモ][デモ]]
- [[#開発環境の整備][開発環境の整備]]
  - [[#ディレクトリ作成][ディレクトリ作成]]
  - [[#セットアップ][セットアップ]]
  - [[#本バッケージ内部で使用するパッケージ][本バッケージ内部で使用するパッケージ]]
- [[#開発][開発]]
  - [[#リロード--自動テスト][リロード & 自動テスト]]
  - [[#テストコード][テストコード]]
  - [[#関数][関数]]

* これは何か？
漁海況業務のリポジトリ．
主にRのパッケージ開発のコミュニケーション用．

* レガシーファイル構成を整理する
** ★カタクチYY.xlsx
*** ファイルがやっていること
各県の月別体長組成を統合し，
- 東シナ海
- 日本海
- 計
というシートで統合する Excel ファイル．
*** 問題点
- バイナリなのでバージョン管理ができない
- 資源評価と漁海況の両方で使用されるが，両業務で集計方法が異なるので紛らわしい．
*** 解決策
- 各県の提出データを読み込み，県ごとに csv 形式のデータベースを作成する．
- データベースから範囲を指定して体長階級×月形式のテーブルを作成する
使用イメージ
#+BEGIN_SRC R :exports code :results silent
fmt_bl("./data.git/漁海況/2018年10月/各県資料/長崎県/", gyokaikyo = TRUE, plot = TRUE)
get_table("./output.git/nagasaki_2018oct.csv", gyokaikyo = TRUE, start = 2016, end = 2017)
#+END_SRC
**** なぜデータベースか？
過去のデータが報告なしに更新されていた場合に対処するため
**** なぜ県ごとか？
差分管理を確実に実施するため
** 各県いわし
* ディレクトリの構成
通常の R パッケージのディレクトリは全て GitHub で公開する．
ただし，以下のディレクトリは GitHub にはアップロードせず，ローカルで管理する（リモートリポジトリを GitHub ではなく，NAS にする）．
- data.git/: 各県から提供されたデータ．
- docs.git/: 予報文案など．
  
* パッケージの機能
** データ目録の生成
** データの統合
** グラフ描画
- 漁獲量
- 体長組成
** 予報文案テンプレートの生成
何らかの構造化マークアップ言語の形式で．
できるだけタグが短いもの．
マークダウンが有力か？
* デモ
* 開発環境の整備
** ディレクトリ作成
#+BEGIN_SRC R :results silent
# usethis::create_package("gyokaikyo")
#+END_SRC
** セットアップ
#+BEGIN_SRC R
setwd("gyokaikyo")
#+END_SRC

#+RESULTS:

** 本バッケージ内部で使用するパッケージ
#+BEGIN_SRC R :results silent
  usethis::use_package("magrittr", "Imports")
  # usethis::use_package("ggplot2", "Imports")
  # usethis::use_package("tibble", "Imports")
  usethis::use_testthat()
#+END_SRC

#+BEGIN_SRC sh :exports results :session nil
cat gyokaikyo/DESCRIPTION
#+END_SRC

#+RESULTS[26e6d91ffe9c3ff5d95f888fb0006e9154a02abb]:
#+begin_example
Package: gyokaikyo
Title: What the Package Does (One Line, Title Case)
Version: 0.0.0.9000
Authors@R: 
    person(given = "First",
           family = "Last",
           role = c("aut", "cre"),
           email = "first.last@example.com")
Description: What the package does (one paragraph).
License: What license it uses
Encoding: UTF-8
LazyData: true
Imports: 
    magrittr
Suggests: 
    testthat
#+end_example

* 開発
** リロード & 自動テスト
#+BEGIN_SRC R :results output
  setwd("gyokaikyo")
  devtools::load_all()
  system("R CMD INSTALL --preclean --no-multiarch --with-keep.source .")
  devtools::test()
  devtools::document(roclets=c('rd', 'collate', 'namespace'))
#+END_SRC


** テストコード
:PROPERTIES:
:header-args: :results silent :exports code
:END:
** 関数
:PROPERTIES:
:header-args: :results silent :exports code
:END:
